tap "anomalyco/tap"
tap "atlassian/acli"
tap "hashicorp/tap"
tap "sheerun/git-squash"
tap "shopify/shopify"

# Simple, modern, secure file encryption
brew "age"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Emacs dependency management
brew "cask"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Human-friendly and fast alternative to cut and (sometimes) awk
brew "choose-rust"
# Diff that understands syntax
brew "difftastic"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Post-modern modal text editor
brew "helix"
# Modern alternative to the watch command
brew "hwatch"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# Remote terminal application
brew "mosh"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Open source relational database management system
brew "mysql@8.4", link: true
# Selects the right Node package manager based on lockfiles
brew "ni"
# Swiss-army knife of markup format conversion
brew "pandoc"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@18"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Pre-commit re-implemented in Rust
brew "prek"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Code-search similar to ack
brew "the_silver_searcher"
# Ultra fast grep with query UI, fuzzy search, archive search, and more
brew "ugrep"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Software to interact with Atlassian Cloud from the terminal
brew "atlassian/acli/acli"
# Terraform
brew "hashicorp/tap/terraform"
# Squash commits on branch just like GitHub's 'Squash and merge'
brew "sheerun/git-squash/git-squash"
# Small library to manage encrypted secrets using asymmetric encryption
brew "shopify/shopify/ejson"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Memory training application
cask "anki"
# AI Coding Agent IDE
cask "antigravity"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Screen recording software
cask "cap"
# Anthropic's official Claude AI desktop app
cask "claude"
# Time tracking tool for agencies and freelancers
cask "clockify"
# Image, video and clipboard optimiser
cask "clop"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Write, edit, and chat about your code with AI
cask "cursor"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Database version management tool
cask "dbngin"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
# Open-source video transcoder
cask "handbrake-app"
# Convert your caps lock key or any of your modifier keys to the hyper key
cask "hyperkey"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice@beta"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Optimise your webcam, headset, and Logi Dock for video meetings
cask "logitune"
# Screen and video recording software
cask "loom"
# Trims video and audio files losslessly
cask "losslesscut"
# CSV editor
cask "modern-csv"
# TouchBar customization app
cask "mtmr"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# App to write, plan, collaborate, and get organised
cask "notion"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# WebKit based web browser
cask "orion"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# PDF editor
cask "sejda-pdf"
# Text editor for code, markup and prose
cask "sublime-text"
# Dictation tool including LLM reformatting
cask "tableplus"
# To-do list
cask "todoist-app"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Free messaging and calling application
cask "wechat"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdGuard Mini", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Monosnap", id: 540348655
mas "Sequel Ace", id: 1518036000
mas "Table Tool", id: 1122008420
