tap "anomalyco/tap" # Needed for opencode (AI coding agent)
tap "atlassian/acli" # Needed for acli (Atlassian CLI)
tap "hashicorp/tap" # Needed for terraform
tap "sheerun/git-squash" # Needed for git-squash
tap "shopify/shopify" # Needed for ejson (encrypted secrets management)

brew "age" # Simple, modern, secure file encryption
brew "ansible" # Automate deployment, configuration, and upgrading
brew "bash" # Bourne-Again SHell, a UNIX command interpreter
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "coreutils" # GNU File, Shell, and Text utilities
brew "cask" # Emacs dependency management
brew "chezmoi" # Manage your dotfiles across multiple diverse machines, securely
brew "choose-rust" # Human-friendly and fast alternative to cut and (sometimes) awk
brew "difftastic" # Diff that understands syntax
brew "duckdb" # Embeddable SQL OLAP Database Management System
brew "duti" # Select default apps for documents and URL schemes on macOS
brew "entr" # Run arbitrary commands when files change
brew "eza" # Modern, maintained replacement for ls
brew "fd" # Simple, fast and user-friendly alternative to find
brew "ffmpeg" # Play, record, convert, and stream select audio and video codecs
brew "fnm" # Fast and simple Node.js version manager
brew "fzf" # Command-line fuzzy finder written in Go
brew "gemini-cli" # Interact with Google Gemini AI models from the command-line
brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "git-filter-repo" # Quickly rewrite git repository history
brew "graphviz" # Graph visualization software from AT&T and Bell Labs
brew "helix" # Post-modern modal text editor
brew "hwatch" # Modern alternative to the watch command
brew "hyperfine" # Command-line benchmarking tool
brew "imagemagick" # Tools and libraries to manipulate images in select formats
brew "jc" # Serializes the output of command-line tools to structured JSON output
brew "jq" # Lightweight and flexible command-line JSON processor
brew "just" # Save and run project-specific commands
brew "lazydocker" # Lazier way to manage everything docker
brew "lnav" # Curses-based tool for viewing and analyzing log files
brew "mas" # Mac App Store command-line interface
brew "mcfly" # Fly through your shell history
brew "mosh" # Remote terminal application
brew "mycli" # CLI for MySQL with auto-completion and syntax highlighting
brew "mysql@8.4", link: true # Open source relational database management system
brew "ni" # Selects the right Node package manager based on lockfiles
brew "pandoc" # Swiss-army knife of markup format conversion
brew "pgcli" # CLI for Postgres with auto-completion and syntax highlighting
brew "pipx" # Execute binaries from Python packages in isolated environments
brew "postgresql@18" # Object-relational database system
brew "pre-commit" # Framework for managing multi-language pre-commit hooks
brew "prek" # Pre-commit re-implemented in Rust
brew "pyenv" # Python version management
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt" # Autoformat shell script source code
brew "tealdeer" # Very fast implementation of tldr in Rust
brew "the_silver_searcher" # Code-search similar to ack
brew "ugrep" # Ultra fast grep with query UI, fuzzy search, archive search, and more
brew "uv" # Extremely fast Python package and project manager, written in Rust.
brew "vim" # Vi 'workalike' with many additional features
brew "watch" # Executes a program periodically, showing output fullscreen
brew "wget" # Internet file retriever
brew "yamlfmt" # Extensible command-line tool to format YAML files
brew "yt-dlp" # Feature-rich command-line audio/video downloader
brew "zoxide" # Shell extension to navigate your filesystem faster
brew "anomalyco/tap/opencode" # The AI coding agent built for the terminal.
brew "atlassian/acli/acli" # Software to interact with Atlassian Cloud from the terminal
brew "hashicorp/tap/terraform" # Terraform
brew "sheerun/git-squash/git-squash" # Squash commits on branch just like GitHub's 'Squash and merge'
brew "shopify/shopify/ejson" # Small library to manage encrypted secrets using asymmetric encryption

cask "adobe-acrobat-reader" # View, print, and comment on PDF documents
cask "balenaetcher" # Flash OS images to SD cards & USB drives, safely and easily
cask "antigravity" # AI Coding Agent IDE
cask "bruno" # Open source IDE for exploring and testing APIs
cask "cap" # Screen recording software
cask "chatgptno" # Official ChatGPT desktop app
cask "claude" # Anthropic's official Claude AI desktop app
cask "clockify" # Time tracking tool for agencies and freelancers
cask "clop" # Image, video and clipboard optimiser
cask "copilot-cli" # Brings the power of Copilot coding agent directly to your terminal
cask "cursor" # Write, edit, and chat about your code with AI
cask "db-browser-for-sqlite" # Browser for SQLite databases
cask "dbngin" # Database version management tool
cask "discord" # Voice and text chat software
cask "docker-desktop" # App to build and share containerised applications and microservices
cask "figma" # Collaborative team software
cask "freedom" # App and website blocker
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "google-chrome" # Google's browser
cask "firefox" # Web browser
cask "handbrake-app" # Open-source video transcoder
cask "hyperkey" # Convert your caps lock key or any of your modifier keys to the hyper key
cask "iina" # Free and open-source media player
cask "imageoptim" # Tool to optimise images to a smaller size
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app
cask "jordanbaird-ice@beta" # Menu bar manager
cask "kap" # Open-source screen recorder built with web technology
cask "karabiner-elements" # Keyboard customiser
cask "keycastr" # Open-source keystroke visualiser
cask "logitune" # Optimise your webcam, headset, and Logi Dock for video meetings
cask "loom" # Screen and video recording software
cask "losslesscut" # Trims video and audio files losslessly
cask "modern-csv" # CSV editor
cask "mtmr" # TouchBar customization app
cask "obsidian" # Knowledge base that works on local Markdown files
cask "orion" # WebKit based web browser
cask "postman" # Collaboration platform for API development
cask "raycast" # Control your tools with a few keystrokes
cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas
cask "raspberry-pi-imager" # Flashes OS images onto SD cards for Raspberry Pis
cask "sejda-pdf" # PDF editor
cask "sublime-text" # Text editor for code, markup and prose
cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas
cask "sejda-pdf" # PDF editor
cask "sublime-text" # Text editor for code, markup and prose
cask "tableplus" # Dictation tool including LLM reformatting
cask "todoist-app" # To-do list
cask "visual-studio-code" # Open-source code editor
cask "vlc" # Multimedia player
cask "vscodium" # Binary releases of VS Code without MS branding/telemetry/licensing
mas "Sequel Ace", id: 1518036000
mas "Splice Crop", id: 1406676254
cask "wechat"
cask "whatsapp" # Native desktop client for WhatsApp
cask "zed" # Multiplayer code editor
cask "zoom" # Video communication and virtual meeting platform

mas "AdGuard Mini", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Monosnap", id: 540348655
mas "Table Tool", id: 1122008420
